/**
 * Debounce — функция будет выполнена только тогда, когда после последней попытки вызова прошло определённое время. 
 * Задержка начинает заново отсчитываться с каждой новой попыткой вызова. 
 * Например если повесить debounce на onscroll с временем 100ms, то функция выполнится через 100ms после прекращения скрола.
 */

/**
 * Throttling — функция будет выполняться не чаще одного раза в указанный период, даже если она будет вызвана много раз в течение этого периода.
 * Например если повесить throttle на onscroll с временем 100ms, то функция будет выполнятся каждые 100ms пока происходит скролинг.
 */

TODO

